# Dateipfad ändern

In [1]:
cd G:\Meine Ablage\Projekte\Coursera\Datascience\SQL\Script\HR

G:\Meine Ablage\Projekte\Coursera\Datascience\SQL\Script\HR

# Dateien Importieren

In [2]:
import pandas as pd
departments_df = pd.read_csv("Departments.csv")
employees_df = pd.read_csv("Employees_updated.csv")
jobs_df = pd.read_csv("Jobs.csv")

# sqlite ohne magic methods

In [3]:
import sqlite3
con = sqlite3.connect("Marco2.db")
cur = con.cursor()

departments_df.to_sql("departments", con, if_exists='replace', index=False,method="multi")
employees_df.to_sql("employees", con, if_exists='replace', index=False,method="multi")
jobs_df.to_sql("jobs", con, if_exists='replace', index=False,method="multi")

9

In [4]:
statement = '''SELECT * FROM jobs limit 3'''
cur.execute(statement)

In [5]:
print("All the data")
output_all = cur.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(200, 'Sr.Software Developer', 60000, 80000)
(300, 'Jr.Software Developer', 40000, 60000)
(400, 'Jr.Software Developer', 40000, 60000)

## eigene Tabelle erstellen

In [6]:
table = """ create table IF NOT EXISTS Freunde(ID INTEGER PRIMARY KEY NOT NULL, Name VARCHAR(20),
Nachname VARCHAR(20), Age INTEGER);"""

try:
    cur.execute(table)
except:
    print("didnt work")
else:
    print("Table is Ready")

try:
    cur.execute('''insert into Freunde values 
                (1, 'Marco', 'Rothermel', 30),
                (2, 'Tobi', 'Eikmanns', 30),
                (3, 'Chris', 'Rothermel', 32),
                (4, 'Flo', 'Fischer', 31)''')
except:
    print("didnt work")
else:
    print("Data added to table")

Table is Ready
Data added to table

In [7]:
statement = '''SELECT * FROM Freunde'''
cur.execute(statement)

print("All the data")
output_all = cur.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Marco', 'Rothermel', 30)
(2, 'Tobi', 'Eikmanns', 30)
(3, 'Chris', 'Rothermel', 32)
(4, 'Flo', 'Fischer', 31)

In [8]:
# Close the connection
con.close()

# sqlite mit magic methods

In [14]:
import sqlite3
con = sqlite3.connect("Marco.db")
cur = con.cursor()
%load_ext sql
%sql sqlite:///Marco.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Columns ändern

In [ ]:
columns_jobs = ("job_id", 'title', 'income', 'no_idea')
columns_employees = (4, 'Research and Development', 'Berlin')
columns_jobs = (4, 'Research and Development', 'Berlin')

## alle tabellen anzeigen lassen

In [15]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///Marco.db
Done.

[('departments',), ('employees',), ('jobs',)]

In [16]:
%sql select * from jobs

 * sqlite:///Marco.db
Done.

[(200, 'Sr.Software Developer', 60000, 80000),
 (300, 'Jr.Software Developer', 40000, 60000),
 (400, 'Jr.Software Developer', 40000, 60000),
 (500, 'Jr. Architect', 50000, 70000),
 (600, 'Lead Architect', 70000, 100000),
 (650, 'Jr. Designer', 60000, 70000),
 (660, 'Jr. Designer', 60000, 70000),
 (234, 'Sr. Designer', 70000, 90000),
 (220, 'Sr. Designer', 70000, 90000)]

In [12]:
%sql PRAGMA table_info(jobs)

 * sqlite:///Marco.db
Done.

[(0, '100', 'INTEGER', 0, None, 0),
 (1, 'Sr. Architect', 'TEXT', 0, None, 0),
 (2, '60000', 'INTEGER', 0, None, 0),
 (3, '100000', 'INTEGER', 0, None, 0)]

In [13]:
# Close the connection
con.close()